NRELApp/src/jbiServiceUnits/GetMaintOrder/LogRequest.wsdl

<definitions name="LogRequest" targetNamespace="http://j2ee.netbeans.org/wsdl/GetMaintOrder/src/LogRequest"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/" xmlns:tns="http://j2ee.netbeans.org/wsdl/GetMaintOrder/src/LogRequest" xmlns:ns="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/GetMaintOrder/src/LogRequest">
            <xsd:import namespace="http://iec.ch/TC57/2015/GetMaintenanceOrdersMessage" schemaLocation="file:/Users/BenGoodwin/git/nrel/61968/wsdl/CimGet/xsd/GetMaintenanceOrdersMessage.xsd"/>
        </xsd:schema>
    </types>
    <message name="WriteInputMessage">
        <part name="part1" element="ns:GetMaintenanceOrdersRequestMessage"/>
    </message>    
    <portType name="FileOutboundPortType">
        <operation name="write">
            <input name="input1" message="tns:WriteInputMessage"/>
        </operation>
    </portType>
    <binding name="FileOutboundBinding" type="tns:FileOutboundPortType">
        <file:binding/>
        <operation name="write">
            <file:operation verb="write"/>
            <input name="input1">
                <file:message fileName="GetMaintOrderRequestLog.xml" use="literal" part="part1" recordDelimiter="LINE FEED" multipleRecordsPerFile="true"/>
            </input>
        </operation>
    </binding>
    <service name="FileOutboundService">
        <port name="LogRequest_OutboundPort" binding="tns:FileOutboundBinding">
            <file:address fileDirectory="/tmp"/>
        </port>
    </service>
    <plnk:partnerLinkType name="LogRequest">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="FileOutboundPortTypeRole" portType="tns:FileOutboundPortType"/>
    </plnk:partnerLinkType>
</definitions>
